docs/torsten_developers_guide.org
#+TITLE: Torsten: A Pharmacokinetic/Pharmacodynamic Model Library for Stan
#+SUBTITLE: Developers guide @@latex:\\@@ @@html:<br>@@ (Torsten Version 0.90.0, Stan version 2.29.2)
#+LATEX_CLASS: amsbook
#+LATEX_CLASS_OPTIONS: [12pt, reqno, oneside]

# title page
#+LATEX_HEADER: \newcommand\subtitle[1]{\newcommand\mrgsubtitle{#1}}
#+LATEX_HEADER: \newcommand\mrgproject{}
#+LATEX_HEADER: \newcommand\mrgtitle{Torsten: A Pharmacokinetic/Pharmacodynamic Model Library for Stan}
#+LATEX_HEADER: \newcommand\mrgsubtitle{\large{Developers Guide} \linebreak (Torsten Version 0.90.0, Stan version 2.29.2)}
#+LATEX_HEADER: \include{mrgtitlepage}

# make index
#+LATEX_HEADER: \usepackage{imakeidx}
#+LATEX_HEADER: \makeindex

#+LATEX_HEADER: \usepackage[letterpaper, width=6.5in, height=9in]{geometry}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{pdfpages}
#+LATEX_HEADER: \usepackage{amssymb}
#+LATEX_HEADER: \usepackage{epstopdf}

# define MRG branding color
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \definecolor{MRGGreen}{rgb}{0, 0.350, 0.200}
#+LATEX_HEADER: \usepackage[colorlinks=true, citecolor=MRGGreen, urlcolor=MRGGreen, linkcolor=MRGGreen]{hyperref}

#+LATEX_HEADER: \usepackage{bold-extra}
#+LATEX_HEADER: \usepackage{courier}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{siunitx}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage[framemethod=TikZ, skipabove=10pt, skipbelow=10pt, backgroundcolor=black!3, roundcorner=4pt, linewidth=1pt]{mdframed}
#+LATEX_HEADER: \BeforeBeginEnvironment{minted}{\begin{mdframed}}
#+LATEX_HEADER: \AfterEndEnvironment{minted}{\end{mdframed}}

#+LATEX_HEADER: \usepackage{subcaption}

# remove "chapter" in chapter name
#+LATEX_HEADER: \renewcommand{\chaptername}{}
#+LATEX_HEADER: \numberwithin{equation}{chapter}
#+LATEX_HEADER: \numberwithin{figure}{chapter}
#+LATEX_HEADER: \numberwithin{table}{chapter}

#+LATEX_HEADER: \usepackage[section]{placeins}

# section numbering begins with chapter
#+LATEX_HEADER: \renewcommand{\thesection}{\thechapter.\arabic{section}}

#+LATEX_HEADER: \theoremstyle{remark}
#+LATEX_HEADER: \newtheorem{example}{Example}
#+LATEX_HEADER: \newtheorem{remark}{Remark}

#+MACRO: torsten_ver v0.90.0
#+MACRO: stan_ver v2.29.2
#+MACRO: newline @@latex:\\@@ @@html:<br>@@ @@ascii:|@@

# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <link rel="stylesheet" href="tufte.css"/>

#+hugo_base_dir: ./hugo
#+hugo_section: /

#+hugo_weight: auto
#+hugo_auto_set_lastmod: t

#+OPTIONS: title:t, num:3 d:(not "latex")

* Development team
   :PROPERTIES:
   :UNNUMBERED: t
   :EXPORT_FILE_NAME: dev-team
   :EXPORT_DATE: <2021-06-25 Fri>
   :EXPORT_HUGO_MENU: :menu "main"
   :END:
- [[mailto:billg@metrumrg.com][William R. Gillespie]] , [[https://www.metrumrg.com/][Metrum Research Group]]
- [[mailto:yz@yizh.org][Yi Zhang]] , [[https://www.sagerx.com/][Sage Therapeutics]]
- [[mailto:charles.margossian@columbia.edu][Charles Margossian]] , Columbia University, Department of Statistics
* Acknowledgements
  :PROPERTIES:
  :UNNUMBERED: t
  :EXPORT_FILE_NAME: Acknowledgements
  :EXPORT_DATE: <2021-06-25 Fri>
  :EXPORT_HUGO_MENU: :menu "main"
  :END:
** Institutions
   :PROPERTIES:
   :UNNUMBERED: t
   :END:
We thank Metrum Research Group, Columbia University, and AstraZeneca.
** Funding
   :PROPERTIES:
   :UNNUMBERED: t
   :END:
This work was funded in part by the following organizations:
*** Office of Naval Research (ONR) contract N00014-16-P-2039
  provided as part of the Small Business Technology Transfer (STTR)
  program. The content of the information presented in this document
  does not necessarily reflect the position or policy of the
  Government and no official endorsement should be inferred.
*** Bill & Melinda Gates Foundation.
** Individuals
   :PROPERTIES:
   :UNNUMBERED: t
   :END:
  We thank the Stan Development Team for giving us guidance on how to
  create new Stan functions and adding features to Stan's core language
  that facilitate building ODE-based models.
* Introduction
  :PROPERTIES:
  :export_FILE_NAME: _index
  :EXPORT_DATE: <2021-06-25 Fri>
  :EXPORT_OPTIONS: toc:nil num:nil
  :END:
Following Stan's code structure, Torsten forks four Stan repositories:
- The automatic differentiation and mathematical infrastructure [[https://github.com/metrumresearchgroup/math][=Stan/Math=]].
- The inference engine and statistical model infrastructure [[https://github.com/metrumresearchgroup/stan][=Stan=]].
- Platform-independent command line interface [[https://github.com/metrumresearchgroup/cmdstan][=CmdStan=]].
- Stan language to C++ transpiler [[https://github.com/metrumresearchgroup/stanc3][=stanc3=]].

Same as Stan, the forked repos are in a submodule hierarchy
#+begin_src bash
  Torsten/cmdstan/stan/lib/stan_math
#+end_src

Additionally Torsten's own mathematical functions are in a separate
repository. It is a submodule of =Stan/Math= that
contains all of Torsten functions 

#+begin_src bash
  Torsten/cmdstan/stan/lib/stan_math/stan/math/torsten
#+end_src
as well as tests.
#+begin_src bash
  Torsten/cmdstan/stan/lib/stan_math/stan/math/torsten/test
#+end_src

The rest of this document describes the basic layout of the components
in Torsten implementation. The details can be found in code comments.

* =torsten_math=
  :PROPERTIES:
  :EXPORT_FILE_NAME: _index
  :EXPORT_DATE: <2021-06-25 Fri>
  :EXPORT_OPTIONS: toc:nil num:nil
  :END:

  Most Torsten development occurs in the =torsten_math= repo. So far
  most functions there are for solving PKPD ODE systems. To
  understand the design, let us take a look at the user-facing =pmx_solve_rk45= function as an example.
#+begin_src cpp
  template <typename F, typename... Ts>
  auto pmx_solve_rk45(const F& f, const int nCmt, Ts... args) {
    using scheme_t = torsten::dsolve::odeint_scheme_rk45;
    return 
    PMXSolveODE<dsolve::PMXOdeIntegrator<dsolve::PMXVariadicOdeSystem, dsolve::PMXOdeintIntegrator<scheme_t>>>::solve(f, nCmt, args...);
}
#+end_src
The argument =f= is the ODE right-hand-side specification, =nCmt= is
the number of the states which equals to the size of =f='s
output. Parameter pack =args= are for NMTRAN-compatible event
specification as well as ODE solver controls. The function is
just a wrapper of the line
#+begin_src cpp
  PMXSolveODE<dsolve::PMXOdeIntegrator<dsolve::PMXVariadicOdeSystem,
  dsolve::PMXOdeintIntegrator<scheme_t>>>::solve(f, nCmt, args...);
#+end_src

=PMXOdeIntegrator= class describes the ODE integrator. It has two
template arguments. The first is =PMXVariadicOdeSystem= that will be
constructed using =f= and provides the ODE information (RHS, Jacobian,
etc). The second is =PMXOdeintIntegrator= that indicates we will be
using an integrator from =Boost::odeint= library. The specific
integrator is =torsten::dsolve::odeint_scheme_rk45=. An alternative 
is 
#+begin_src cpp
  torsten::dsolve::odeint_scheme_ckrk
#+end_src
used in =pmx_solve_ckrk=.

Here =PMXVariadicOdeSystem= is used to differentiate from the old ways
of using fixed parameters in ODE solvers, which is still used in unit tests.
The =PMXOdeintIntegrator= parameter is used to set apartment from
=CVODES= ODE solvers that =pmx_solve_bdf= and =pmx_solve_adams= are
based on.

** PMX solver
   The =PMXSolveODE= class uses the type of ODE integrator and ODE
   system as arguments. It is the basis of all user-facing numerical
   ODE functions. It provides a =static= function =solve= that uses
   event schedule arguments and ODE controls to 
   - construct events from NMTRAN arguments,
   - construct requested ODE integrator,
   - construct event solvers according to the events and the type of integrator,
   - solve events chronologically.

   A similar class =PMXSolveCPT= does the same but for compartment
   models that employ close-form solutions.

