docs/torsten_developers_guide.tex
% Created 2022-05-18 Wed 13:44
% Intended LaTeX compiler: pdflatex
\documentclass[12pt, reqno, oneside]{amsbook}
              \newcommand\subtitle[1]{\newcommand\mrgsubtitle{#1}}
\newcommand\mrgproject{}
\newcommand\mrgtitle{Torsten: A Pharmacokinetic/Pharmacodynamic Model Library for Stan}
\newcommand\mrgsubtitle{\large{Developers Guide} \linebreak (Torsten Version 0.90.0, Stan version 2.29.2)}
\include{mrgtitlepage}
\usepackage{imakeidx}
\makeindex
\usepackage[letterpaper, width=6.5in, height=9in]{geometry}
\usepackage{graphicx}
\usepackage{pdfpages}
\usepackage{amssymb}
\usepackage{epstopdf}
\usepackage{xcolor}
\definecolor{MRGGreen}{rgb}{0, 0.350, 0.200}
\usepackage[colorlinks=true, citecolor=MRGGreen, urlcolor=MRGGreen, linkcolor=MRGGreen]{hyperref}
\usepackage{bold-extra}
\usepackage{courier}
\usepackage{listings}
\usepackage{siunitx}
\usepackage{booktabs}
\usepackage[framemethod=TikZ, skipabove=10pt, skipbelow=10pt, backgroundcolor=black!3, roundcorner=4pt, linewidth=1pt]{mdframed}
\BeforeBeginEnvironment{minted}{\begin{mdframed}}
\AfterEndEnvironment{minted}{\end{mdframed}}
\usepackage{subcaption}
\renewcommand{\chaptername}{}
\numberwithin{equation}{chapter}
\numberwithin{figure}{chapter}
\numberwithin{table}{chapter}
\usepackage[section]{placeins}
\renewcommand{\thesection}{\thechapter.\arabic{section}}
\theoremstyle{remark}
\newtheorem{example}{Example}
\newtheorem{remark}{Remark}


\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[newfloat]{minted}
\usepackage{caption}
\setcounter{secnumdepth}{3}
\author{Yi Zhang}
\date{\today}
\title{Torsten: A Pharmacokinetic/Pharmacodynamic Model Library for Stan\\\medskip
\large Developers guide \\  (Torsten Version 0.90.0, Stan version 2.29.2)}
\hypersetup{
 pdfauthor={Yi Zhang},
 pdftitle={Torsten: A Pharmacokinetic/Pharmacodynamic Model Library for Stan},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\chapter*{Development team}
\label{sec:org9bb72d8}
\begin{itemize}
\item \href{mailto:billg@metrumrg.com}{William R. Gillespie} , \href{https://www.metrumrg.com/}{Metrum Research Group}
\item \href{mailto:yz@yizh.org}{Yi Zhang} , \href{https://www.sagerx.com/}{Sage Therapeutics}
\item \href{mailto:charles.margossian@columbia.edu}{Charles Margossian} , Columbia University, Department of Statistics
\end{itemize}
\chapter*{Acknowledgements}
\label{sec:org4fd8ba7}
\section*{Institutions}
\label{sec:orgc7e58d4}
We thank Metrum Research Group, Columbia University, and AstraZeneca.
\section*{Funding}
\label{sec:org209e741}
This work was funded in part by the following organizations:
\subsection*{Office of Naval Research (ONR) contract N00014-16-P-2039}
\label{sec:orgee502e1}
provided as part of the Small Business Technology Transfer (STTR)
program. The content of the information presented in this document
does not necessarily reflect the position or policy of the
Government and no official endorsement should be inferred.
\subsection*{Bill \& Melinda Gates Foundation.}
\label{sec:orgb66b095}
\section*{Individuals}
\label{sec:org431c2f6}
We thank the Stan Development Team for giving us guidance on how to
create new Stan functions and adding features to Stan's core language
that facilitate building ODE-based models.
\chapter{Introduction}
\label{sec:orgca864c7}
Following Stan's code structure, Torsten forks four Stan repositories:
\begin{itemize}
\item The automatic differentiation and mathematical infrastructure \href{https://github.com/metrumresearchgroup/math}{\texttt{Stan/Math}}.
\item The inference engine and statistical model infrastructure \href{https://github.com/metrumresearchgroup/stan}{\texttt{Stan}}.
\item Platform-independent command line interface \href{https://github.com/metrumresearchgroup/cmdstan}{\texttt{CmdStan}}.
\item Stan language to C++ transpiler \href{https://github.com/metrumresearchgroup/stanc3}{\texttt{stanc3}}.
\end{itemize}

Same as Stan, the forked repos are in a submodule hierarchy
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
Torsten/cmdstan/stan/lib/stan_math
\end{minted}

Additionally Torsten's own mathematical functions are in a separate
repository. It is a submodule of \texttt{Stan/Math} that
contains all of Torsten functions 

\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
Torsten/cmdstan/stan/lib/stan_math/stan/math/torsten
\end{minted}
as well as tests.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
Torsten/cmdstan/stan/lib/stan_math/stan/math/torsten/test
\end{minted}

The rest of this document describes the basic layout of the components
in Torsten implementation. The details can be found in code comments.

\chapter{\texttt{torsten\_math}}
\label{sec:org70ecd1c}
Most Torsten development occurs in the \texttt{torsten\_math} repo. So far
most functions there are for solving PKPD ODE systems. To
understand the design, let us take a look at the user-facing \texttt{pmx\_solve\_rk45} function as an example.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{cpp}
  template <typename F, typename... Ts>
  auto pmx_solve_rk45(const F& f, const int nCmt, Ts... args) {
    using scheme_t = torsten::dsolve::odeint_scheme_rk45;
    return 
    PMXSolveODE<dsolve::PMXOdeIntegrator<dsolve::PMXVariadicOdeSystem, dsolve::PMXOdeintIntegrator<scheme_t>>>::solve(f, nCmt, args...);
}
\end{minted}
The argument \texttt{f} is the ODE right-hand-side specification, \texttt{nCmt} is
the number of the states which equals to the size of \texttt{f}'s
output. Parameter pack \texttt{args} are for NMTRAN-compatible event
specification as well as ODE solver controls. The function is
just a wrapper of the line
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{cpp}
PMXSolveODE<dsolve::PMXOdeIntegrator<dsolve::PMXVariadicOdeSystem,
dsolve::PMXOdeintIntegrator<scheme_t>>>::solve(f, nCmt, args...);
\end{minted}

\texttt{PMXOdeIntegrator} class describes the ODE integrator. It has two
template arguments. The first is \texttt{PMXVariadicOdeSystem} that will be
constructed using \texttt{f} and provides the ODE information (RHS, Jacobian,
etc). The second is \texttt{PMXOdeintIntegrator} that indicates we will be
using an integrator from \texttt{Boost::odeint} library. The specific
integrator is \texttt{torsten::dsolve::odeint\_scheme\_rk45}. An alternative 
is 
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{cpp}
torsten::dsolve::odeint_scheme_ckrk
\end{minted}
used in \texttt{pmx\_solve\_ckrk}.

Here \texttt{PMXVariadicOdeSystem} is used to differentiate from the old ways
of using fixed parameters in ODE solvers, which is still used in unit tests.
The \texttt{PMXOdeintIntegrator} parameter is used to set apartment from
\texttt{CVODES} ODE solvers that \texttt{pmx\_solve\_bdf} and \texttt{pmx\_solve\_adams} are
based on.

\section{PMX solver}
\label{sec:org9dfe6ab}
The \texttt{PMXSolveODE} class uses the type of ODE integrator and ODE
system as arguments. It is the basis of all user-facing numerical
ODE functions. It provides a \texttt{static} function \texttt{solve} that uses
event schedule arguments and ODE controls to 
\begin{itemize}
\item construct events from NMTRAN arguments,
\item construct requested ODE integrator,
\item construct event solvers according to the events and the type of integrator,
\item solve events chronologically.
\end{itemize}

A similar class \texttt{PMXSolveCPT} does the same but for compartment
models that employ close-form solutions.
