docs/torsten_developers_guide.org
** PMX ODE integrators
The purpose of =PMXOdeIntegrator= class is to separate the ODE solver,
the control parameters of numerical solutions, the ODE system, and the
user-facing functions. A =PMXOdeIntegrator= object is constructed
based on the type of ODE system (variadic or not), the type of solver
to be used (=Boost::odeint= vs =CVODES=), and the controls (tolerance
and maximum number of steps).

An =PMXOdeIntegrator= object is constructed inside
=PMXSolveODE::solve= for numerically solving ODEs.

** ODE integrators
=PMXOdeIntegrator= class delegates to specific types of ODE
integrators from =Boost::odeint= and =CVODES= libraries for actual numerical
solution. Thus it has a type argument that specifies the integrator
to be used. All the supported numerical solvers can be found in
=torsten_math/dsolve=. Torsten uses its own implementation based on
library APIs instead of directly build upon Stan's ODE integration
functions.

** PMX models
In =PMXSolveCPT= and =PMXSolveODE= class, PMX models are constructed
using NMTRAN inputs. For example, the one-compartment model class has
the following construct.
#+begin_src cpp
  template<typename T_par>
  class PMXOneCptModel {
    const T_par &CL_;
    const T_par &V2_;
    const T_par &ka_;
    const T_par k10_;
    const std::vector<T_par> alpha_;
    const std::vector<T_par> par_;

  public:
    static constexpr int Ncmt = 2;
    static constexpr int Npar = 3;
    static constexpr PMXOneCptODE f_ = PMXOneCptODE();

  //...
  };
#+end_src
One can see that it stores model parameters clearance, volume of
distribution, absorption coefficient, which are used to construct
parameters of close-form solutions. The class also contains static
components such as number of compartments, number of parameters, and
the RHS of the one-compartment ODE system.

Here is a list of Torsten models ("/" indicate the model consisting
two coupled components)

#+CAPTION: Models supported in Torsten
| Model                     | Class                  | File                          |
|---------------------------+------------------------+-------------------------------|
| One-cpt PK                | =PMXOneCptModel=       | =pmx_onecpt_model.hpp=        |
| Two-cpt PK                | =PMXTwoCptModel=       | =pmx_twocpt_model.hpp=        |
| Linear ODE                | =PMXLinODEModel=       | =pmx_linode_model.hpp=        |
| One-cpt/effective-cpt     | =PMXOneCptEffCptModel= | =pmx_onecpt_effcpt_model.hpp= |
| Two-cpt/effective-cpt     | =PMXTwoCptEffCptModel= | =pmx_twocpt_effcpt_model.hpp= |
| General ODE               | =PKODEModel=           | =pmx_ode_model.hpp=           |
| Close-form PK/general ODE | =PKCoupledModel=       | =pmx_coupled_model.hpp=       |
|---------------------------+------------------------+-------------------------------|

Each model has an overloaded member function =solve= that solves a given
event. The overloading is for different signatures in transient and
steady-state solutions.

** Event management
The =PMXSolveODE::solve= (=PMXSolveCPT::solve= is similar) function
looks like this.

#+begin_src cpp
    template <typename T0, typename T1, typename T2, typename T3, typename T4,
              typename T5, typename T6, typename F>
    static stan::matrix_return_t<T0, T1, T2, T3, T4, T5, T6>
    solve(
    // args...
         ) {
    // ...

      using ER = NONMENEventsRecord<T0, T1, T2, T3>;
      using EM = EventsManager<ER, NonEventParameters<T0, T4, std::vector, std::tuple<T5, T6> >>;
      const ER events_rec(nCmt, time, amt, rate, ii, evid, cmt, addl, ss);

      Matrix<typename EM::T_scalar, -1, -1> pred(EM::nCmt(events_rec), events_rec.num_event_times());

      using model_type = torsten::PKODEModel<typename EM::T_par, F>;

      integrator_type integrator(rel_tol, abs_tol, max_num_steps, as_rel_tol, as_abs_tol, as_max_num_steps, msgs);
      EventSolver<model_type, EM> pr;

      pr.pred(0, events_rec, pred, integrator, pMatrix, biovar, tlag, nCmt, f);
      return pred;
    }
#+end_src
One can see that first a =NONMENEventsRecord= object is created using
the NMTRAN arguments (template parameter type T1-T6 are for these
arguments), then =EventsManager= and =EventSolver= objects are
constructed. The purpose of =EventsManager= is to create and sort
events chronologically, based on NMTRAN input. The purpose of
=EventSolver= is to solve the events using specified ODE solver.

* =stan/math=
The =stan/math= repo serves as a pass-through fork for
=torsten_math=. It is almost identical to Stan's upstream repo, with the
only noticeable difference in the =math/stan/math.hpp=, in which the
=torsten= namespace is added:

#+begin_src cpp
#ifndef STAN_MATH_HPP
#define STAN_MATH_HPP

/**
 * \defgroup prob_dists Probability Distributions
 */

/**
 * \ingroup prob_dists
 * \defgroup multivar_dists Multivariate Distributions
 * Distributions with Matrix inputs
 */
/**
 * \ingroup prob_dists
 * \defgroup univar_dists Univariate Distributions
 * Distributions with scalar, vector, or array input.
 */

#include <stan/math/rev.hpp>

#include <stan/math/torsten/torsten.hpp>
using namespace torsten;
#endif
#+end_src

One can generate C++ code documention for Torsten using the same
doxygen process as in =stan/math=.
#+begin_src bash
  make doxygen
#+end_src
To access the generated Torsten documentation, point the browser to 
#+begin_src bash
  /stan_math/doc/api/html/index.html
#+end_src
and find =torsten= namespace.

* =Stan=
The forked =stan= serves passing =stan/math= through as well as
testing ground for experimental inference algorithms such as
cross-chain warmup (see Section 6.2).

* =CmdStan=
Similar to =Stan=, the forked command line interface has boilerplate
code for the cross-chain warmup algorithm. It also contains
Torsten-specific =makefile= flags. Similar to its upstream repo,
the making process will download a =stanc3= binary in order to
transpile =Stan= code to =C++= code. Changes have been made in the
repo to download Torsten-compatible =stanc3= binary so that the
transpiler recoganizes Torsten function signatures.

* MPI parallelization
As an alternative to Stan's =reduce_sum= function designed for
multicore infrastrue, Torsten provides MPI parallelization for
population models as well as experimental cross-chain warmup model.

** Population solver
The population solver functions =pmx_solve_group_rk45|bdf|adams= have similar
construct to their single-subject counterparts. For example
#+begin_src cpp
  template <typename F, typename... Ts>
  auto pmx_solve_group_bdf(const F& f, const int nCmt,
                           const std::vector<int>& len, Ts... args) {
    return PMXSolveGroupODE<dsolve::PMXOdeIntegrator<dsolve::PMXVariadicOdeSystem, dsolve::PMXCvodesIntegrator<CV_BDF, CV_STAGGERED>>>::solve(f, nCmt, len, args...);
  }
#+end_src
is the group solver version of =pmx_solve_bdf=. The only difference is
instead of using =PMXSolveODE= here we use =PMXSolveGroupODE= class to
numerically solve the /population's/ ODEs.

When looping through events, group solver distributes the population
to parallel processes for ODE solution. At the end of each event, the
solver collects results of the entire population from the
processes. This mechanism is implemented in the =EventSolver= class,
along with its sequential version.

