docs/torsten_developers_guide.tex

\section{PMX ODE integrators}
\label{sec:org70bc868}
The purpose of \texttt{PMXOdeIntegrator} class is to separate the ODE solver,
the control parameters of numerical solutions, the ODE system, and the
user-facing functions. A \texttt{PMXOdeIntegrator} object is constructed
based on the type of ODE system (variadic or not), the type of solver
to be used (\texttt{Boost::odeint} vs \texttt{CVODES}), and the controls (tolerance
and maximum number of steps).

An \texttt{PMXOdeIntegrator} object is constructed inside
\texttt{PMXSolveODE::solve} for numerically solving ODEs.

\section{ODE integrators}
\label{sec:orga6a7e17}
\texttt{PMXOdeIntegrator} class delegates to specific types of ODE
integrators from \texttt{Boost::odeint} and \texttt{CVODES} libraries for actual numerical
solution. Thus it has a type argument that specifies the integrator
to be used. All the supported numerical solvers can be found in
\texttt{torsten\_math/dsolve}. Torsten uses its own implementation based on
library APIs instead of directly build upon Stan's ODE integration
functions.

\section{PMX models}
\label{sec:orgea0adf9}
In \texttt{PMXSolveCPT} and \texttt{PMXSolveODE} class, PMX models are constructed
using NMTRAN inputs. For example, the one-compartment model class has
the following construct.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{cpp}
template<typename T_par>
class PMXOneCptModel {
  const T_par &CL_;
  const T_par &V2_;
  const T_par &ka_;
  const T_par k10_;
  const std::vector<T_par> alpha_;
  const std::vector<T_par> par_;

public:
  static constexpr int Ncmt = 2;
  static constexpr int Npar = 3;
  static constexpr PMXOneCptODE f_ = PMXOneCptODE();

//...
};
\end{minted}
One can see that it stores model parameters clearance, volume of
distribution, absorption coefficient, which are used to construct
parameters of close-form solutions. The class also contains static
components such as number of compartments, number of parameters, and
the RHS of the one-compartment ODE system.

Here is a list of Torsten models ("/" indicate the model consisting
two coupled components)

\begin{table}[htbp]
\caption{Models supported in Torsten}
\centering
\begin{tabular}{lll}
Model & Class & File\\
\hline
One-cpt PK & \texttt{PMXOneCptModel} & \texttt{pmx\_onecpt\_model.hpp}\\
Two-cpt PK & \texttt{PMXTwoCptModel} & \texttt{pmx\_twocpt\_model.hpp}\\
Linear ODE & \texttt{PMXLinODEModel} & \texttt{pmx\_linode\_model.hpp}\\
One-cpt/effective-cpt & \texttt{PMXOneCptEffCptModel} & \texttt{pmx\_onecpt\_effcpt\_model.hpp}\\
Two-cpt/effective-cpt & \texttt{PMXTwoCptEffCptModel} & \texttt{pmx\_twocpt\_effcpt\_model.hpp}\\
General ODE & \texttt{PKODEModel} & \texttt{pmx\_ode\_model.hpp}\\
Close-form PK/general ODE & \texttt{PKCoupledModel} & \texttt{pmx\_coupled\_model.hpp}\\
\hline
\end{tabular}
\end{table}

Each model has an overloaded member function \texttt{solve} that solves a given
event. The overloading is for different signatures in transient and
steady-state solutions.

\section{Event management}
\label{sec:org45a94d9}
The \texttt{PMXSolveODE::solve} (\texttt{PMXSolveCPT::solve} is similar) function
looks like this.

\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{cpp}
template <typename T0, typename T1, typename T2, typename T3, typename T4,
          typename T5, typename T6, typename F>
static stan::matrix_return_t<T0, T1, T2, T3, T4, T5, T6>
solve(
// args...
     ) {
// ...

  using ER = NONMENEventsRecord<T0, T1, T2, T3>;
  using EM = EventsManager<ER, NonEventParameters<T0, T4, std::vector, std::tuple<T5, T6> >>;
  const ER events_rec(nCmt, time, amt, rate, ii, evid, cmt, addl, ss);

  Matrix<typename EM::T_scalar, -1, -1> pred(EM::nCmt(events_rec), events_rec.num_event_times());

  using model_type = torsten::PKODEModel<typename EM::T_par, F>;

  integrator_type integrator(rel_tol, abs_tol, max_num_steps, as_rel_tol, as_abs_tol, as_max_num_steps, msgs);
  EventSolver<model_type, EM> pr;

  pr.pred(0, events_rec, pred, integrator, pMatrix, biovar, tlag, nCmt, f);
  return pred;
}
\end{minted}
One can see that first a \texttt{NONMENEventsRecord} object is created using
the NMTRAN arguments (template parameter type T1-T6 are for these
arguments), then \texttt{EventsManager} and \texttt{EventSolver} objects are
constructed. The purpose of \texttt{EventsManager} is to create and sort
events chronologically, based on NMTRAN input. The purpose of
\texttt{EventSolver} is to solve the events using specified ODE solver.

\chapter{\texttt{stan/math}}
\label{sec:org7dc0359}
The \texttt{stan/math} repo serves as a pass-through fork for
\texttt{torsten\_math}. It is almost identical to Stan's upstream repo, with the
only noticeable difference in the \texttt{math/stan/math.hpp}, in which the
\texttt{torsten} namespace is added:

\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{cpp}
#ifndef STAN_MATH_HPP
#define STAN_MATH_HPP

/**
 * \defgroup prob_dists Probability Distributions
 */

/**
 * \ingroup prob_dists
 * \defgroup multivar_dists Multivariate Distributions
 * Distributions with Matrix inputs
 */
/**
 * \ingroup prob_dists
 * \defgroup univar_dists Univariate Distributions
 * Distributions with scalar, vector, or array input.
 */

#include <stan/math/rev.hpp>

#include <stan/math/torsten/torsten.hpp>
using namespace torsten;
#endif
\end{minted}

One can generate C++ code documention for Torsten using the same
doxygen process as in \texttt{stan/math}.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
make doxygen
\end{minted}
To access the generated Torsten documentation, point the browser to 
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
/stan_math/doc/api/html/index.html
\end{minted}
and find \texttt{torsten} namespace.

\chapter{\texttt{Stan}}
\label{sec:orgf458996}
The forked \texttt{stan} serves passing \texttt{stan/math} through as well as
testing ground for experimental inference algorithms such as
cross-chain warmup (see Section 6.2).

\chapter{\texttt{CmdStan}}
\label{sec:org2a9133b}
Similar to \texttt{Stan}, the forked command line interface has boilerplate
code for the cross-chain warmup algorithm. It also contains
Torsten-specific \texttt{makefile} flags. Similar to its upstream repo,
the making process will download a \texttt{stanc3} binary in order to
transpile \texttt{Stan} code to \texttt{C++} code. Changes have been made in the
repo to download Torsten-compatible \texttt{stanc3} binary so that the
transpiler recoganizes Torsten function signatures.

\chapter{MPI parallelization}
\label{sec:orgdcb8853}
As an alternative to Stan's \texttt{reduce\_sum} function designed for
multicore infrastrue, Torsten provides MPI parallelization for
population models as well as experimental cross-chain warmup model.

\section{Population solver}
\label{sec:org2f84dde}
The population solver functions \texttt{pmx\_solve\_group\_rk45|bdf|adams} have similar
construct to their single-subject counterparts. For example
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{cpp}
template <typename F, typename... Ts>
auto pmx_solve_group_bdf(const F& f, const int nCmt,
                         const std::vector<int>& len, Ts... args) {
  return PMXSolveGroupODE<dsolve::PMXOdeIntegrator<dsolve::PMXVariadicOdeSystem, dsolve::PMXCvodesIntegrator<CV_BDF, CV_STAGGERED>>>::solve(f, nCmt, len, args...);
}
\end{minted}
is the group solver version of \texttt{pmx\_solve\_bdf}. The only difference is
instead of using \texttt{PMXSolveODE} here we use \texttt{PMXSolveGroupODE} class to
numerically solve the \emph{population's} ODEs.

When looping through events, group solver distributes the population
to parallel processes for ODE solution. At the end of each event, the
solver collects results of the entire population from the
processes. This mechanism is implemented in the \texttt{EventSolver} class,
along with its sequential version.
