docs/torsten_developers_guide.org
** Cross-chain warmup
The experimental algorithm sits on top of Stan's sampler engine.
#+begin_src bash
  Torsten/cmdstan/src/stan/mcmc/cross_chain
#+end_src
The sampler is modified to include the cross-chain adaptation.
For example, function =adapt_diag_e_nuts::transition= becomes
#+begin_src cpp
  sample transition(sample& init_sample, callbacks::logger& logger) {
    sample s = diag_e_nuts<Model, BaseRNG>::transition(init_sample, logger);

    if (this->adapt_flag_) {
      this->stepsize_adaptation_.learn_stepsize(this->nom_epsilon_,
                                                s.accept_stat());

      if (this -> use_cross_chain_adapt()) {
        /// cross chain adapter has its own var adaptor so needs to add sample
        this -> add_cross_chain_sample(s.log_prob(), this -> z().q);
        bool update = this -> cross_chain_adaptation(this -> z().inv_e_metric_, logger);
        if (update) {
          // this->init_stepsize(logger);
          double new_stepsize = this -> cross_chain_stepsize(this->nom_epsilon_);
          this -> set_nominal_stepsize(new_stepsize);
          this->stepsize_adaptation_.set_mu(log(10 * this->nom_epsilon_));
          this->stepsize_adaptation_.restart();
        }
      } else {
        bool update = this->var_adaptation_.learn_variance(this->z_.inv_e_metric_,
                                                           this->z_.q);
        if (update) {
          this->init_stepsize(logger);
          this->stepsize_adaptation_.set_mu(log(10 * this->nom_epsilon_));
          this->stepsize_adaptation_.restart();
        }
      }
    }
    return s;
  }
#+end_src
The =this -> use_cross_chain_adapt= condition controls if cross-chain
warmup is used and choose the adaptation accordingly. 

* =stanc3=
The forked =stanc3= contains a 
#+begin_src bash
stanc3/src/middle/torsten.ml
#+end_src
file for Torsten function signatures. Unlike Stan functions, functions
like =pmx_solve_rk45= supports a long list of signatures in order to
allow a combination of
- parameters shared by the entire population vs subject-specifc,
- time-independent parameters vs time-dependent parameters,
- default (thus omittable) $F=1.0$ vs user-specified bioavailability,
- default (thus omittable) $t_{\text{Lag}}=0.0$ vs user-specified lag time,
- default (thus omittable) vs user-specified control parameters.

Any higher-order Torsten function must have its signature defined in
=torsten.ml= in order to be recognized by the transpiler. Thus the
workflow of adding a Torsten function usually is to first implement
the function in =torsten_stan= followed by adding its signature in =torsten.ml=.

** Adding a new function
Now let us walkthrough how a new function is added in Torsten using
=pmx_solve_linode= function as example. The function solves
dosing events using a linear ODE model, specified as a coefficient
matrix for the RHS of a linear ODE.

First we implement the C++ function in =torsten_math=. As one can find
at
#+begin_src bash
stan_math/stan/math/torsten/pmx_solve_linode.hpp
#+end_src
the implementation should be in =torsten= namespace.

#+begin_src c++
namespace torsten {
  // ...
template <typename T0, typename T1, typename T2, typename T3,
          typename T4, typename T5, typename T6>
stan::matrix_return_t<T0, T1, T2, T3, T4, T5, T6>
pmx_solve_linode(const std::vector<T0>& time,
                 const std::vector<T1>& amt,
                 const std::vector<T2>& rate,
                 const std::vector<T3>& ii,
                 const std::vector<int>& evid,
                 const std::vector<int>& cmt,
                 const std::vector<int>& addl,
                 const std::vector<int>& ss,
                 const std::vector< Eigen::Matrix<T4, -1, -1> >& system,
                 const std::vector<std::vector<T5> >& biovar,
                 const std::vector<std::vector<T6> >& tlag) {
  // ...
}
}
#+end_src

As part of test-based development process, there multiple unit tests for this function
#+begin_src c++
stan_math/stan/math/torsten/test/unit/linode_typed_finite_diff_test.cpp
stan_math/stan/math/torsten/test/unit/linode_typed_overload_test.cpp
stan_math/stan/math/torsten/test/unit/linode_typed_test.cpp
#+end_src
for testing with finite-difference results, overloaded function
signature, and solution correctness, respectively.

To have the Stan language recoganize a regular function like
=pmx_solve_linode= we only need to add its signature to the
aforementioned =torsten.ml= file. For the above signature, one can
find the corresponding signature
#+begin_src ocaml
  add_func
    ( "pmx_solve_linode"
    , ReturnType UMatrix
    , [ (AutoDiffable, UArray UReal)       (* time *)
      ; (AutoDiffable, UArray UReal)       (* amt *)
      ; (AutoDiffable, UArray UReal)       (* rate *)
      ; (AutoDiffable, UArray UReal)       (* ii *)
      ; (DataOnly, UArray UInt)            (* evid *)
      ; (DataOnly, UArray UInt)            (* cmt *)
      ; (DataOnly, UArray UInt)            (* addl *)
      ; (DataOnly, UArray UInt)            (* ss *)
      ; (AutoDiffable, UArray UMatrix)     (* pMatrix *)
      ; (AutoDiffable, (UArray (UArray UReal)))     (* biovar *)
      ; (AutoDiffable, (UArray (UArray UReal))) ],  (* tlag *)
    Common.Helpers.AoS) ;
#+end_src
One can easily map the above argumentss and return value to the C++
function. Note that we need to make the Stan language aware of whether
an argument could be parameter (=AutoDiffable=) or not (=DataOnly=). 

