docs/torsten_developers_guide.org
** Adding a new high-order function
Torsten's numerical ODE solvers are high-order functions, i.e. functions with function arguments.
Adding a new high-order function is slightly more complicated. 
Let us use =pmx_solve_rk45= as an example. As shown in
Section 1, the function uses variadic arguments in order to support
different signatures. Here let us assume the one of them as follows.
#+begin_src cpp
namespace torsten {
    template <typename T0, typename T1, typename T2, typename T3, typename T4,
              typename T5, typename T6, typename F>
    static stan::matrix_return_t<T0, T1, T2, T3, T4, T5, T6>
    pmx_solve_rk45(const F& f,
                   const int nCmt,
                   const std::vector<T1>& amt,
                   const std::vector<T2>& rate,
                   const std::vector<T3>& ii,
                   const std::vector<int>& evid,
                   const std::vector<int>& cmt,
                   const std::vector<int>& addl,
                   const std::vector<int>& ss,
                   const std::vector<std::vector<T4> >& pMatrix,
                   const std::vector<std::vector<T5> >& biovar,
                   const std::vector<std::vector<T6> >& tlag,
                   std::ostream* msgs) {//...}
}
#+end_src
Note that now we have $f$ for the ODE RHS, =nCmt= as number of
compartments, and =msgs= for I/O of the ODE solver messages.

In order to support the above signature in Stan, in the =torsten.ml=
we need first define the ODE function signature.
#+begin_src ocaml
let pmx_solve_ode_func = 
  [ ( UnsizedType.AutoDiffable
    , UnsizedType.UFun
        ( [ (UnsizedType.AutoDiffable, UnsizedType.UReal) (* time *)
          ; (UnsizedType.AutoDiffable, UnsizedType.UVector) (* states *)
          ; (UnsizedType.AutoDiffable, UArray UReal) (* real param *)
          ; (DataOnly, UArray UReal); (DataOnly, UArray UInt) ] (* int param *)
        , ReturnType UnsizedType.UVector (* return type *)
        , FnPlain, AoS) ) ]
#+end_src

Now we can add the signature as [fn:1]
#+begin_src ocaml
  add_func
    ( "pmx_solve_linode"
    , ReturnType UMatrix
    , [ pmx_solve_ode_func                         (* f *)
      ; (UnsizedType.DataOnly, UnsizedType.UInt)   (* nCmt *)
      ; (AutoDiffable, UArray UReal)       (* time *)
      ; (AutoDiffable, UArray UReal)       (* amt *)
      ; (AutoDiffable, UArray UReal)       (* rate *)
      ; (AutoDiffable, UArray UReal)       (* ii *)
      ; (DataOnly, UArray UInt)            (* evid *)
      ; (DataOnly, UArray UInt)            (* cmt *)
      ; (DataOnly, UArray UInt)            (* addl *)
      ; (DataOnly, UArray UInt)            (* ss *)
      ; (AutoDiffable, UArray UMatrix)     (* pMatrix *)
      ; (AutoDiffable, (UArray (UArray UReal)))     (* biovar *)
      ; (AutoDiffable, (UArray (UArray UReal))) ],  (* tlag *)
    Common.Helpers.AoS) ;
#+end_src

[fn:1] The actual code in =torsten.ml= is more complicated in order to
accomondate many variants of the above signature.

* =Torsten= container
All the above repos are collected in the container repo
=Torsten= using =git subtree= command, so that user only needs to
clone this repo in order to use Torsten. Documentation and example
models can also be found in this repo. Note that the development of
Torsten functionalilties still happens in each submodule.

In the rest of the section we describe the process to upate =Torsten=
to certain Stan release, using Stan's =master= branch as example.

** =Math=
Assume at Torsten's =Math= repo there are remote
#+begin_src bash
bash-3.2$ git remote -vv
origin    git@github.com:metrumresearchgroup/math.git (fetch)
origin    git@github.com:metrumresearchgroup/math.git (push)
stan-dev  https://github.com/stan-dev/math.git (fetch)
stan-dev  https://github.com/stan-dev/math.git (push)
#+end_src
and local branches
#+begin_src bash
bash-3.2$ git branch
  develop                       # upstream stan/math develop
  master                        # upstream stan/math master
  torsten-develop               # torsten develop
  torsten-master                # torsten master
#+end_src
so that we can update =torsten-develop=
#+begin_src bash
bash-3.2$ git branch
  git merge -Xtheirs master     # may need to manually resolve conflicts
#+end_src
Before pushing, make sure the Torsten unit tests are passed. If not,
one may need to iterate between =tortsen_math= and =math= repo to
ensure the implementations are consistent.
#+begin_src bash
bash-3.2$ make clean-all; ./runTests.py -j4 stan/math/torsten/test/unit/
#+end_src
One should run unit tests twice, with and without =TORSTEN_MPI= in
=make/local=, for sequential and parallel tests, respectively [fn:2].
Currently there is a GitHub Actions workflow for sequential unit tests
on Windows, Ubuntu, and MacOS platforms. The action is performed
automatically when one push to Torsten's =math= repo fork.

[fn:2] To run parallel jobs one needs a properly installed MPI
library. Setting =TORSTEN_MPI=1= in the =make/local= prompts
comopiling the tests using =mpicxx=, the MPI-enabled C++ compiler. One
can also specify the MPI comopiler path in =make/local= by setting
=CXX= and =CC= variables.

** =Stan=
The treatment for =Stan= repo follows a same procedure. 

** =stanc3=
Any added/update Torsten function should have its signature registered
in =stanc3= repo. Similar to the previous two repos, we need to first
merge from upstream.
#+begin_src bash
bash-3.2$ git branch
  master                        # stanc3 upstream 
  torsten-develop               # torsten branch
bash-3.2$ git checkout master && git pull
bash-3.2$ git checkout torsten-develop && git merge master
#+end_src
Before merge one should use models in =test/integration/good/torsten=
for integration tests (TODO: need to add these models to =dune= tests).

Before updating =cmdstan=, we need to create a =stanc3= binary for
=make= script to download. This is done using [[https://github.com/metrumresearchgroup/stanc3/actions][the =Build binaries=
action]]. After finish one can collect the binaries as artifacts and
uploaded them to a new release. (TODO: this process can be automated).


** =cmdstan=
Updating =cmdstan= repo requires the same procedure as =math= and
=stan=. In addition, one must update the =TORSTEN_STANC3_VERSION=
variable in =make/torsten_stanc.mk= to reflect the =stanc3=
release. For example, if the latest =stanc3= release for Torsten is
=torsten_v0.90.0rc2=, then one must set
#+begin_src bash
  TORSTEN_STANC3_VERSION=torsten_v0.90.0rc2
#+end_src
so that correct =stanc3= binaries will be downloaded. This is done by
the =make/stanc= script, and one can check if the link there
#+begin_src bash
https://github.com/metrumresearchgroup/stanc3/releases/download/$(TORSTEN_STANC3_VERSION)/$(OS_TAG)-stanc
#+end_src
correctly points to binary artifacts geneated in the previous
section. In the above link =OS_TAG= equals to =mac=, =windows=, or
=ubuntu=.

