docs/torsten_developers_guide.tex

\section{Adding a new high-order function}
\label{sec:org532ee4b}
Torsten's numerical ODE solvers are high-order functions, i.e. functions with function arguments.
Adding a new high-order function is slightly more complicated. 
Let us use \texttt{pmx\_solve\_rk45} as an example. As shown in
Section 1, the function uses variadic arguments in order to support
different signatures. Here let us assume the one of them as follows.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{cpp}
namespace torsten {
    template <typename T0, typename T1, typename T2, typename T3, typename T4,
              typename T5, typename T6, typename F>
    static stan::matrix_return_t<T0, T1, T2, T3, T4, T5, T6>
    pmx_solve_rk45(const F& f,
                   const int nCmt,
                   const std::vector<T1>& amt,
                   const std::vector<T2>& rate,
                   const std::vector<T3>& ii,
                   const std::vector<int>& evid,
                   const std::vector<int>& cmt,
                   const std::vector<int>& addl,
                   const std::vector<int>& ss,
                   const std::vector<std::vector<T4> >& pMatrix,
                   const std::vector<std::vector<T5> >& biovar,
                   const std::vector<std::vector<T6> >& tlag,
                   std::ostream* msgs) {//...}
}
\end{minted}
Note that now we have \(f\) for the ODE RHS, \texttt{nCmt} as number of
compartments, and \texttt{msgs} for I/O of the ODE solver messages.

In order to support the above signature in Stan, in the \texttt{torsten.ml}
we need first define the ODE function signature.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{ocaml}
let pmx_solve_ode_func = 
  [ ( UnsizedType.AutoDiffable
    , UnsizedType.UFun
        ( [ (UnsizedType.AutoDiffable, UnsizedType.UReal) (* time *)
          ; (UnsizedType.AutoDiffable, UnsizedType.UVector) (* states *)
          ; (UnsizedType.AutoDiffable, UArray UReal) (* real param *)
          ; (DataOnly, UArray UReal); (DataOnly, UArray UInt) ] (* int param *)
        , ReturnType UnsizedType.UVector (* return type *)
        , FnPlain, AoS) ) ]
\end{minted}

Now we can add the signature as \footnote{The actual code in \texttt{torsten.ml} is more complicated in order to
accomondate many variants of the above signature.}
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{ocaml}
add_func
  ( "pmx_solve_linode"
  , ReturnType UMatrix
  , [ pmx_solve_ode_func                         (* f *)
    ; (UnsizedType.DataOnly, UnsizedType.UInt)   (* nCmt *)
    ; (AutoDiffable, UArray UReal)       (* time *)
    ; (AutoDiffable, UArray UReal)       (* amt *)
    ; (AutoDiffable, UArray UReal)       (* rate *)
    ; (AutoDiffable, UArray UReal)       (* ii *)
    ; (DataOnly, UArray UInt)            (* evid *)
    ; (DataOnly, UArray UInt)            (* cmt *)
    ; (DataOnly, UArray UInt)            (* addl *)
    ; (DataOnly, UArray UInt)            (* ss *)
    ; (AutoDiffable, UArray UMatrix)     (* pMatrix *)
    ; (AutoDiffable, (UArray (UArray UReal)))     (* biovar *)
    ; (AutoDiffable, (UArray (UArray UReal))) ],  (* tlag *)
  Common.Helpers.AoS) ;
\end{minted}

\chapter{\texttt{Torsten} container}
\label{sec:orgd59585c}
All the above repos are collected in the container repo
\texttt{Torsten} using \texttt{git subtree} command, so that user only needs to
clone this repo in order to use Torsten. Documentation and example
models can also be found in this repo. Note that the development of
Torsten functionalilties still happens in each submodule.

In the rest of the section we describe the process to upate \texttt{Torsten}
to certain Stan release, using Stan's \texttt{master} branch as example.

\section{\texttt{Math}}
\label{sec:org8bcb265}
Assume at Torsten's \texttt{Math} repo there are remote
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
bash-3.2$ git remote -vv
origin    git@github.com:metrumresearchgroup/math.git (fetch)
origin    git@github.com:metrumresearchgroup/math.git (push)
stan-dev  https://github.com/stan-dev/math.git (fetch)
stan-dev  https://github.com/stan-dev/math.git (push)
\end{minted}
and local branches
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
bash-3.2$ git branch
  develop                       # upstream stan/math develop
  master                        # upstream stan/math master
  torsten-develop               # torsten develop
  torsten-master                # torsten master
\end{minted}
so that we can update \texttt{torsten-develop}
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
bash-3.2$ git branch
  git merge -Xtheirs master     # may need to manually resolve conflicts
\end{minted}
Before pushing, make sure the Torsten unit tests are passed. If not,
one may need to iterate between \texttt{tortsen\_math} and \texttt{math} repo to
ensure the implementations are consistent.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
bash-3.2$ make clean-all; ./runTests.py -j4 stan/math/torsten/test/unit/
\end{minted}
One should run unit tests twice, with and without \texttt{TORSTEN\_MPI} in
\texttt{make/local}, for sequential and parallel tests, respectively \footnote{To run parallel jobs one needs a properly installed MPI
library. Setting \texttt{TORSTEN\_MPI=1} in the \texttt{make/local} prompts
comopiling the tests using \texttt{mpicxx}, the MPI-enabled C++ compiler. One
can also specify the MPI comopiler path in \texttt{make/local} by setting
\texttt{CXX} and \texttt{CC} variables.}.
Currently there is a GitHub Actions workflow for sequential unit tests
on Windows, Ubuntu, and MacOS platforms. The action is performed
automatically when one push to Torsten's \texttt{math} repo fork.

\section{\texttt{Stan}}
\label{sec:orgaac0db9}
The treatment for \texttt{Stan} repo follows a same procedure. 

\section{\texttt{stanc3}}
\label{sec:orgb6072a8}
Any added/update Torsten function should have its signature registered
in \texttt{stanc3} repo. Similar to the previous two repos, we need to first
merge from upstream.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
bash-3.2$ git branch
  master                        # stanc3 upstream 
  torsten-develop               # torsten branch
bash-3.2$ git checkout master && git pull
bash-3.2$ git checkout torsten-develop && git merge master
\end{minted}
Before merge one should use models in \texttt{test/integration/good/torsten}
for integration tests (TODO: need to add these models to \texttt{dune} tests).

Before updating \texttt{cmdstan}, we need to create a \texttt{stanc3} binary for
\texttt{make} script to download. This is done using \href{https://github.com/metrumresearchgroup/stanc3/actions}{the \texttt{Build binaries}
action}. After finish one can collect the binaries as artifacts and
uploaded them to a new release. (TODO: this process can be automated).


\section{\texttt{cmdstan}}
\label{sec:orgb3dd27a}
Updating \texttt{cmdstan} repo requires the same procedure as \texttt{math} and
\texttt{stan}. In addition, one must update the \texttt{TORSTEN\_STANC3\_VERSION}
variable in \texttt{make/torsten\_stanc.mk} to reflect the \texttt{stanc3}
release. For example, if the latest \texttt{stanc3} release for Torsten is
\texttt{torsten\_v0.90.0rc2}, then one must set
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
TORSTEN_STANC3_VERSION=torsten_v0.90.0rc2
\end{minted}
so that correct \texttt{stanc3} binaries will be downloaded. This is done by
the \texttt{make/stanc} script, and one can check if the link there
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
https://github.com/metrumresearchgroup/stanc3/releases/download/$(TORSTEN_STANC3_VERSION)/$(OS_TAG)-stanc
\end{minted}
correctly points to binary artifacts geneated in the previous
section. In the above link \texttt{OS\_TAG} equals to \texttt{mac}, \texttt{windows}, or
\texttt{ubuntu}.
