docs/torsten_developers_guide.org
** =Torsten=
The container repo is updated after all the above modules are in
place. We need first create a =remote= for each of the above modules
#+begin_src bash
bash-3.2$ git remote -vv
origin  git@github.com:metrumresearchgroup/Torsten.git (fetch)
origin  git@github.com:metrumresearchgroup/Torsten.git (push)
cmdstan git@github.com:metrumresearchgroup/cmdstan.git (fetch)
cmdstan git@github.com:metrumresearchgroup/cmdstan.git (push)
math    git@github.com:metrumresearchgroup/math.git (fetch)
math    git@github.com:metrumresearchgroup/math.git (push)
stan    git@github.com:metrumresearchgroup/stan.git (fetch)
stan    git@github.com:metrumresearchgroup/stan.git (push)
stanc3  git@github.com:metrumresearchgroup/stanc3.git (fetch)
stanc3  git@github.com:metrumresearchgroup/stanc3.git (push)
torsten_math    git@github.com:metrumresearchgroup/torsten_math.git (fetch)
torsten_math    git@github.com:metrumresearchgroup/torsten_math.git (push)
#+end_src
so that next we can call 
#+begin_src bash
  ./substree_update.sh cmdstan_branch stan_branch math_branch torsten_math_branch
#+end_src
to create the container repo based on the branch name given for each
module. By default the script uses =torsten-develop= branch for
=cmdstan=, =stan=, =math=, and =develop= branch for
=torsten_math=. That is,
#+begin_src bash
  ./substree_update.sh
#+end_src
is equivalent to
#+begin_src bash
  ./substree_update.sh torsten-develop torsten-develop torsten-develop develop
#+end_src

After updating the container we can revise the documentation and
example models in the repo accordingly.
