docs/torsten_developers_guide.tex

\section{\texttt{Torsten}}
\label{sec:org63cb8c1}
The container repo is updated after all the above modules are in
place. We need first create a \texttt{remote} for each of the above modules
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
bash-3.2$ git remote -vv
origin  git@github.com:metrumresearchgroup/Torsten.git (fetch)
origin  git@github.com:metrumresearchgroup/Torsten.git (push)
cmdstan git@github.com:metrumresearchgroup/cmdstan.git (fetch)
cmdstan git@github.com:metrumresearchgroup/cmdstan.git (push)
math    git@github.com:metrumresearchgroup/math.git (fetch)
math    git@github.com:metrumresearchgroup/math.git (push)
stan    git@github.com:metrumresearchgroup/stan.git (fetch)
stan    git@github.com:metrumresearchgroup/stan.git (push)
stanc3  git@github.com:metrumresearchgroup/stanc3.git (fetch)
stanc3  git@github.com:metrumresearchgroup/stanc3.git (push)
torsten_math    git@github.com:metrumresearchgroup/torsten_math.git (fetch)
torsten_math    git@github.com:metrumresearchgroup/torsten_math.git (push)
\end{minted}
so that next we can call 
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
./substree_update.sh cmdstan_branch stan_branch math_branch torsten_math_branch
\end{minted}
to create the container repo based on the branch name given for each
module. By default the script uses \texttt{torsten-develop} branch for
\texttt{cmdstan}, \texttt{stan}, \texttt{math}, and \texttt{develop} branch for
\texttt{torsten\_math}. That is,
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
./substree_update.sh
\end{minted}
is equivalent to
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
./substree_update.sh torsten-develop torsten-develop torsten-develop develop
\end{minted}

After updating the container we can revise the documentation and
example models in the repo accordingly.
\end{document}
